git - создается папка  яв-ся скрытой
git remote add url -оно добавляет 
git pull - изменение с какой то и либо ветки (git pull origin master)
get status -  показывает статус тоест  показывает какие файлы добавлены или изменины
git add - добавляет файлы  в рабочей папке в индекс 
git commit -  добавляет все файлы  где находиться в индексе
(git commit -m "comment")
git branch  - это команда являяется менеджерам веток с помощью этой команды  можно посмотреть список  веток и выбрать необходимую ветку
git branch name branch  
git checkout name branch  - даная команда  производить  переключение к ветку с именем branch
git push  origin -  отвечает за отправку кода  в удаленный репозитории 
git resert filename -  отвечает за удалеение файла из индекса

